 # -*- coding: utf-8 -*- #
# CREATED BY: caisongrui
# CREATED ON: 2024/10/11 09:14
# LAST MODIFIED ON:
# AIM:

import unittest
from app.model.process_data import DataProcessor
class TestFormatLabelStudio(unittest.TestCase):
    def testcase1(self):
        input_dict = {
            'content': '\n\n\t西南医科大学附属医院\n\n\t入院记录\n\n\t科室：\t姓名：周元崇\t床号：A43\t住院号：IP0000339905\n\t心血管内科病区（忠山院区）\n\n\t姓名：周元崇\t性别：男\n\n\t年龄：74岁\t出生日期：19...100mmHg\n\n\t一般情况：发育正常，营养良好，体型匀称，神志清晰，体位自主，面容与表情安静。\n\n\t皮肤黏膜：皮肤颜色正常，温度正常，弹性正常，无水肿、斑等，毛发分布正常。\n\n\t淋巴 结：全身浅表淋巴结无肿大。\n\n\t第（1）页',
            'labels': ['HN', 'HD', 'TI', 'PI', 'PI', 'PI', 'PI', 'PI', 'PI', 'PI', 'PI', 'PI', 'PI', 'PI', 'PI', 'PI',
                       'PI', 'PI', 'TI', 'TI', 'PI', 'TI', 'PI', 'PI', 'PI', 'PI', 'TI', 'HD', 'TI', 'TI', 'OTHER',
                       'TI', 'OTHER', 'OTHER', 'CI_U', 'OTHER', 'OTHER', 'OTHER', 'TI', 'TI', 'TI', 'TI', 'CI_U',
                       'CI_U', 'TI', 'TI'],
            'offsets': [[3, 13], [16, 20], [23, 26], [27, 30], [34, 37], [41, 45], [75, 78], [82, 85], [89, 92],
                        [96, 101], [114, 117], [120, 123], [129, 132], [135, 140], [161, 166], [178, 181], [196, 199],
                        [202, 207], [211, 216], [233, 240], [259, 265], [270, 276], [281, 287], [291, 297], [311, 317],
                        [330, 339], [358, 363], [384, 391], [394, 397], [414, 418], [653, 656], [662, 666], [666, 669],
                        [678, 682], [690, 695], [695, 699], [757, 762], [765, 772], [775, 779], [845, 849], [865, 869],
                        [902, 906], [918, 926], [926, 934], [950, 955], [991, 996]]
        }
        format_dict = DataProcessor.dict_to_labelstudio(input_dict)
        print(format_dict)

    def testcase2(self):
        input_dict = {"content":"\n\n\t重庆黔江民族医院检验报告单重庆医科大学附属第二医院黔江分院\n\n\t性\t别：男\t门诊号：20030000送检医生：游治虎目的：心肌三合一定量\n\t姓名：倪明山\t备注：\n\t科室：心血管内科门诊\t状态\t单位\t参考范围\n\t临床诊断：\t结果\n\t电请号：202000833515\t简称\tng/ml\t<100\n\t序号中文名称\t26.20\tng/ml\t<4.0\n\tMyo\t2.16\t≤0.1\n\t肌红张白\tCK-MB\tng/ml\n\t0.05\n\n\t检验时间：2020-03-0109：52 报告时间：2020-03-0110:13\n\t采样时间：2020-03-0109:05签收时间：2020-03-0109:52\t审核者签名： 王秀\n\t注：此结果仅对本次检测标本负责！\t检验者：冉茂红\n\t如果对结果有疑义，请在收到结果7个工作日内与我们联系，多谢合作！","offsets":[[37,39],[41,45],[53,58],[73,76],[80,83],[85,88],[96,99],[102,108],[108,113],[114,116],[120,122],[138,144],[150,157],[163,169],[175,179],[195,201],[201,208],[215,220],[236,241],[258,263],[278,283],[299,302],[310,312],[320,325],[327,330],[339,344]],"labels":["PI","OTHER","TI","PI","TI","TI","CI_TI","CI_TI","TI","OTHER","PI","CI_U","CI_TI","CI_U","CI_ABB","CI_ABB","CI_U","TI","TI","TI","TI","TI","TI","OTHER","TI","OTHER"]}
        format_dict = DataProcessor.dict_to_labelstudio(input_dict)
        print(format_dict)
